forums/admin/applications_addon/ips/nexus/sources/shipping/libs/fedex/PickupService_v3/CreatePickupRequest_v3.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v3="http://fedex.com/ws/pickup/v3">
   <soapenv:Header/>
   <soapenv:Body>
      <v3:CreatePickupRequest>
         <v3:WebAuthenticationDetail>
            <v3:UserCredential>
               <v3:Key></v3:Key>
               <v3:Password></v3:Password>
            </v3:UserCredential>
         </v3:WebAuthenticationDetail>
         <v3:ClientDetail>
            <v3:AccountNumber></v3:AccountNumber>
            <v3:MeterNumber></v3:MeterNumber>
            <v3:Localization>
               <v3:LanguageCode>EN</v3:LanguageCode>
               <v3:LocaleCode>ES</v3:LocaleCode>
            </v3:Localization>
         </v3:ClientDetail>
         <v3:TransactionDetail>
            <v3:CustomerTransactionId>CreatePickup_v3</v3:CustomerTransactionId>
         </v3:TransactionDetail>
         <v3:Version>
            <v3:ServiceId>disp</v3:ServiceId>
            <v3:Major>3</v3:Major>
            <v3:Intermediate>0</v3:Intermediate>
            <v3:Minor>0</v3:Minor>
         </v3:Version>
         <v3:OriginDetail>
            <v3:UseAccountAddress>0</v3:UseAccountAddress>
            <v3:PickupLocation>
               <v3:Contact>
                  <v3:PersonName>Komal</v3:PersonName>
                  <v3:CompanyName>Syntel</v3:CompanyName>
                  <v3:PhoneNumber>9403808209</v3:PhoneNumber>
                  <v3:EMailAddress>komal_kapate@syntelinc.com</v3:EMailAddress>
               </v3:Contact>
               <v3:Address>
                  <v3:StreetLines>2900 AIRPORT RD</v3:StreetLines>
                  <v3:City>Denton</v3:City>
                  <v3:StateOrProvinceCode>TX</v3:StateOrProvinceCode>
                  <v3:PostalCode>76207</v3:PostalCode>
                  <v3:CountryCode>US</v3:CountryCode>
               </v3:Address>
            </v3:PickupLocation>
            <v3:PackageLocation>FRONT</v3:PackageLocation>
            <v3:BuildingPart>DEPARTMENT</v3:BuildingPart>
            <v3:BuildingPartDescription>OPERATIONS</v3:BuildingPartDescription>
            <v3:ReadyTimestamp>2010-12-27T13:00:00</v3:ReadyTimestamp>
            <v3:CompanyCloseTime>17:00:00</v3:CompanyCloseTime>
         </v3:OriginDetail>
         <v3:PackageCount>1</v3:PackageCount>
         <v3:TotalWeight>
            <v3:Units>LB</v3:Units>
            <v3:Value>145.0</v3:Value>
         </v3:TotalWeight>
         <v3:CarrierCode>FDXE</v3:CarrierCode>
         <v3:OversizePackageCount>1</v3:OversizePackageCount>
         <v3:Remarks>Preet</v3:Remarks>
         <v3:CommodityDescription>Freight</v3:CommodityDescription>
         <v3:CountryRelationship>INTERNATIONAL</v3:CountryRelationship>
      </v3:CreatePickupRequest>
   </soapenv:Body>
</soapenv:Envelope>